{
  "main": { "columnHeadings": ["TIMELINE", "SKILL", "TECHNOLOGY"] },
  "summary": {
    "heading": "Summary",
    "text": "Software engineer with broad experience in technology, mostly helping teams face challenges with data. Highly attentive to detail, skilled in data science, data engineering, analytics, interactive data visualisation, and cloud technologies."
  },
  "explain": {
    "heading": "Work Experience Dendrogram",
    "paragraphs": [
      "The chart to the left shows the relationship between my work experience and the skills I acquired during those roles.",
      "Each role is listed under 'Timeline'. The next column 'Skill' links each role to skill categories in which the tools that are listed under the technology column belong.",
      "Hovering over or selecting each role highlights each of the links between those categories and tools.",
      "To see more detail on each role, click on one of these roles in the left hand column and more detail will be visible in the panel directly above this one."
    ]
  },
  "detail": [
    {
      "heading": "Education",
      "selected": -1,
      "values": {
        "title": null,
        "duration": null,
        "education": [
          {
            "name": "University of Nottingham, 2012-13",
            "award": "Msc Economics"
          },
          {
            "name": "Keele University, 2009-12",
            "award": "BA Economics (First class)"
          }
        ]
      }
    },
    {
      "heading": "Mindshare",
      "selected": 1,
      "values": {
        "title": "Data Analyst",
        "duration": "November 2013 - August 2014",
        "summary": "Mindshare WorldWide is a global media agency, part of WPP Group.",
        "placements": [
          {
            "name": null,
            "description": [
              {
                "text": "Primarily a data analysis and reporting role for the American Express account, driven by Excel, SQL Server and Python."
              }
            ]
          }
        ]
      }
    },
    {
      "heading": "Rated People",
      "selected": 2,
      "values": {
        "title": "BI Developer",
        "duration": "September 2014 - September 2016",
        "summary": "Rated People is an online marketplace connecting homeowners and tradespeople throughout the UK.",
        "placements": [
          {
            "name": null,
            "description": [
              {
                "text": "Migrating business intelligence away from MS Office applications by developing and maintaining a code base in python that automated all non-web based reports to the business"
              },
              {
                "text": "Managing several complex dashboards in Excel using data from internal databases on active users, sales, jobs posted and much more"
              },
              {
                "text": "Improved performance by removing slow MS Access/Excel steps in the BI reporting pipelines by writing efficient SQL queries embedded in python scripts"
              },
              {
                "text": "Developed a user-friendly interactive dashboard in d3.js, showing vital information to the business and circulating insight to non-technical colleagues"
              },
              {
                "text": "Deployed a random forest model to predict customer churn on a monthly basis"
              }
            ]
          }
        ]
      }
    },
    {
      "heading": "Charles River Associates",
      "selected": 3,
      "values": {
        "title": "Data Scientist",
        "duration": "October 2016 - December 2018",
        "summary": "Charles River Associates (CRA) is a leading global consulting firm that offers business, financial, and economic consulting services to major law firms, corporations, and governments around the world.",
        "placements": [
          {
            "name": null,
            "description": [
              {
                "text": "Leading a sub-team of up to two other data scientists, supporting a wider group of 60+ economic consultants in the European Competition Practice with ongoing casework."
              },
              {
                "text": "Working on a number of high-profile retail mergers, including:",
                "subText": [
                  "BP-Woolworths, 2016-18 (ACCA)",
                  "ASDA-Sainsburys, 2017-18 (CMA)",
                  "DFS-Sofology, 2017 (CMA)"
                ]
              },
              {
                "text": "Analysis typically involves anticipating theories of harm in the context of the litigation - local overlap, entry & exit, price modelling analyses are common in retail mergers"
              },
              {
                "text": "Extremely fast-paced environment, a significant proportion of ad-hoc, exploratory analysis"
              },
              {
                "text": "Built & maintained end-to-end data pipelines from databases or other storage methods to final analysis across multiple workstreams & cases. Data occasionally large (100m+ rows)."
              },
              {
                "text": "Managed ArcGIS software and most geospatial analysis, plus various other technology functions"
              },
              {
                "text": "Played an evangelical role in supporting the company to use modern computing practices, provided training to colleagues worldwide covering python, ArcGIS, Excel, data visualisation and web scraping"
              },
              {
                "text": "Built extensive core infrastructure in python including:",
                "subText": [
                  "Software to process the calculation of millions of driving times per hour",
                  "Automated map generation API with ArcPy & ArcGIS, saving hundreds of hours of consultant time",
                  "Generalised & customised WSS & Fascia Count calculators for a vast array of scenarios based on regulatory precedents",
                  "Google Maps API connector using asyncio + aiohttp"
                ]
              }
            ]
          }
        ]
      }
    },
    {
      "heading": "Decathlon UK (contract)",
      "selected": 4,
      "values": {
        "title": "React Developer",
        "duration": "January 2019 - June 2019",
        "summary": "Decathlon is a global sporting goods retailer with a presence in nearly 50 countries worldwide.",
        "placements": [
          {
            "name": null,
            "description": [
              {
                "text": "Solely responsible for the entire build and delivery of an interactive business intelligence dashboard application (“Playbook”)"
              },
              {
                "text": "Designed to make data @ Decathlon more accessible to store managers, sport leaders and other stakeholders throughout the business"
              },
              {
                "text": "Modern web development tools such as React, D3, Node, GraphQL, Python and MongoDB used throughout"
              }
            ]
          }
        ]
      }
    },
    {
      "heading": "Infinity Works",
      "selected": 5,
      "values": {
        "title": "Data Engineer",
        "duration": "July 2019 - January 2021",
        "summary": "Infinity Works is one of the UK's leading digital transformation and engineering consultancies, delivering value in large technology-led projects in a variety of sectors including government, retail, energy, and financial services.",
        "placements": [
          {
            "name": "Placement 1: Online Tech Company",
            "description": [
              {
                "text": "Helped a team replace a system of some 160+ data pipelines, moving several TB/day through various systems."
              },
              {
                "text": "The project migrated the orchestration from cron triggers to being scheduled using an airflow cluster, working closely with another project to migrate from Qlikview to Looker."
              },
              {
                "text": "Quickly grasped a huge legacy code base (100k lines+) to provide insight on data tracing data definitions in database tables for marketing, product, and analytics teams."
              },
              {
                "text": "Supported other teams that relied on this legacy system, fixing ongoing issues, using a variety of AWS services such as ECS, EMR, Athena, Redshift and more."
              }
            ]
          },
          {
            "name": "Placement 2: FTSE 100 Multinational",
            "description": [
              {
                "text": "A green-field project to build a compliance tool to help senior stakeholders monitor maturity and best practices amongst engineering teams globally, from POC stage all the way to a fully scalable application."
              },
              {
                "text": "This was achieved using Azure Data Factory, Azure SQL Server and Power BI, deployable via a CI/CD pipeline using Azure DevOps and ARM templates."
              },
              {
                "text": "During this project, my focus was on designing, building and maintaining the data model from inception to handover, working with the client to adapt the model as more features were included."
              },
              {
                "text": "Also played a large role in ensuring transformations were performed correctly, developing transformers in python that were deployed as Azure functions."
              }
            ]
          },
          {
            "name": "Placement 3: Online Price Comparison Site",
            "description": [
              {
                "text": "A CRM system migration to allow streaming of events between the client’s web UI and Salesforce, enabling real-time communication to customers based on their activity."
              },
              {
                "text": "Introduced to a vast array of new technologies, e.g. Kafka, Kubernetes, Java."
              },
              {
                "text": "Primarily an SDET role, but I played a key part as a BA to drive through and explain complex logical requirements of each transformer service in between the web UI and Salesforce to the team."
              },
              {
                "text": "Developed an automated testing application using Behave, a BDD framework in python, defining and building a suite of test cases against each key transformer service, helping reduce reliance on manual testing, to increase coverage and improve confidence that business requirements were me."
              }
            ]
          }
        ]
      }
    },
    {
      "heading": "Talking Medicines",
      "selected": 6,
      "values": {
        "title": "Senior Software Engineer",
        "duration": "Jan 2021 - now",
        "summary": "Talking Medicines are on a mission to become the world's gold standard patient intelligence by medicine.",
        "placements": [
          {
            "name": null,
            "description": [
              {
                "text": "Managing a small team of developers to build and maintain a SaaS product providing access to Patient Intelligence to clients in the Pharmaceutical industry"
              },
              {
                "text": "Responsible for data pipelines, statistical robustness, design, performance, security, reliability and data quality"
              },
              {
                "text": "Built a new data feature to automatically detect relevant insights for users based on statistical anomalies"
              },
              {
                "text": "Integrated a new data source from initial scoping to being fully incorporated into the product"
              },
              {
                "text": "Implemented best practices for security and cost management in Azure"
              }
            ]
          }
        ]
      }
    },
    {
      "heading": "Side Projects & Volunteering",
      "selected": 7,
      "values": {
        "duration": "Ongoing",
        "placements": [
          {
            "name": "Side projects",
            "description": [
              {
                "text": "Like many engineers, I start a lot more side projects than I finish. I'm always open to ideas but I'm generally unavailable for new projects if I'm working full time."
              }
            ]
          },
          {
            "name": "Level Up Mentor",
            "description": [
              {
                "text": "Level Up is a mentorship scheme for connecting experienced UK tech professionals with young technologists in Iraq, Syria and Iran."
              },
              {
                "text": "I host regular online calls with a young person living in Iraq and provide advice and help for developing their career in technology"
              }
            ]
          },
          {
            "name": "Codeclub & CoderDojo volunteering",
            "description": [
              {
                "text": "Working with Code Club, an international network of volunteers and educators running free coding clubs for young people across the UK"
              },
              {
                "text": "Teaching groups children of ages 7+ on a weekly basis. Activities usually involve taking students through exercises in scratch, HTML & CSS, Python, and introducing students to robotics with the BBC Microbit"
              }
            ]
          }
        ]
      }
    }
  ]
}
